case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libincompressibleRASModels.so"
    "liblduSolvers.so"
    "libNEPCM.so"
);

application     NEPCMForcedConvectionPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    allowSystemOperations 1;
}

functions
{
    postProcess
    {
        functionObjectLibs	("libutilityFunctionObjects.so");
        type			coded;
        enabled			true;
        outputControl		outputTime;//timeStep;
        redirectType		postProcess;

        code
        #{
            std::ofstream output;
            output.open("postProcess.txt",std::ofstream::app);

            //- dimensionless numbers
            scalar rhobf = 996.5;
            scalar mubf = 8.5e-4;
            scalar kappabf = 0.628;
            scalar Cpbf = 4181.0;
            scalar nubf = mubf/rhobf;
            scalar alphabf = kappabf/(rhobf*Cpbf);
            scalar charL = 18e-3;
            scalar charV = 0.01;
            scalar deltaTemp = 20.0;

            scalar Prbf = nubf/alphabf;
            scalar Rebf = (charL)/nubf;
            scalar Pebf = Rebf*Prbf;


            //- lookup fields
            const volScalarField& T = mesh().lookupObject<volScalarField>("T");
            const volScalarField& kappa = mesh().lookupObject<volScalarField>("kappa");
            surfaceScalarField gradT = fvc::snGrad(T);

            //- find id and compute Nusselt number
            label bottomID = T.mesh().boundaryMesh().findPatchID("bottom");
            scalar bottomArea = sum(T.mesh().magSf().boundaryField()[bottomID]);
            scalar bottomHeatFluxAvg = sum(kappa.boundaryField()[bottomID]*gradT.boundaryField()[bottomID]*T.mesh().magSf().boundaryField()[bottomID])/bottomArea;
            scalar bottomhAvg = bottomHeatFluxAvg/deltaTemp;
            scalar NusseltAvg = (bottomhAvg*charL)/(kappabf);

            //- save data
            output << NusseltAvg << "\n";
            output.close();
        #};
    }

}

// ************************************************************************* //
