case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel	NEPCM;
alphaEqActivation inactive;

Prt		Prt [ 0 0 0 0 0 0 0 ] 0.85;
l		l [ 0 0 0 0 0 0 0 ] 0.447;
lambda		lambda [ 0 0 0 0 0 0 0 ] 3;
kB		kB [ 1 2 -2 -1 0 0 0 ] 1.38064e-23;

//Thermal properties of base fluid
rhof		rhof [ 1 -3 0 0 0 0 0 ] 995.6;
Cpf		Cpf [ 0 2 -2 -1 0 0 0 ] 4181;
kappaf		kappaf [ 1 1 -3 -1 0 0 0 ] 0.628;
muf		muf [ 1 -1 -1 0 0 0 0 ] 8.5e-4;

//Thermal properties of NEPCM's core
rhoc		rhoc [ 1 -3 0 0 0 0 0 ] 721;
Cpc		Cpc [ 0 2 -2 -1 0 0 0 ] 2037;
kappac		kappac [ 1 1 -3 -1 0 0 0 ] 0.1825;
Tf		Tf [ 0 0 0 1 0 0 0 ] 303.59;
TMr		TMr [ 0 0 0 1 0 0 0 ] 0.24;
hc		hc [ 0 2 -2 0 0 0 0 ] 211000;

//Thermal properties of NEPCM's shell
rhos		rhos [ 1 -3 0 0 0 0 0 ] 786;
Cps		Cps [ 0 2 -2 -1 0 0 0 ] 1317.7;
kappas		kappas [ 1 1 -3 -1 0 0 0 ] 0.025;
ds		ds [ 0 1 0 0 0 0 0 ] 1e-07;

// ************************************************************************* //
